{
  "_name_or_path": "dima806/car_models_image_detection",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Acura ILX",
    "1": "Acura MDX",
    "2": "Acura NSX",
    "3": "Acura RDX",
    "4": "Acura RLX",
    "5": "Acura TLX",
    "6": "Alfa Romeo 4C",
    "7": "Alfa Romeo 4C Spider",
    "8": "Alfa Romeo Giulia",
    "9": "Alfa Romeo Stelvio",
    "10": "Aston Martin DB11",
    "11": "Aston Martin DBS",
    "12": "Aston Martin Vanquish",
    "13": "Aston Martin Vantage",
    "14": "Audi A3",
    "15": "Audi A4",
    "16": "Audi A5",
    "17": "Audi A6",
    "18": "Audi A7",
    "19": "Audi A8",
    "20": "Audi Q3",
    "21": "Audi Q5",
    "22": "Audi Q7",
    "23": "Audi Q8",
    "24": "Audi R8",
    "25": "Audi TT",
    "26": "Audi e-tron",
    "27": "BMW 2-Series",
    "28": "BMW 3-Series",
    "29": "BMW 4-Series",
    "30": "BMW 5-Series",
    "31": "BMW 6-Series",
    "32": "BMW 7-Series",
    "33": "BMW 8-Series",
    "34": "BMW X1",
    "35": "BMW X2",
    "36": "BMW X3",
    "37": "BMW X4",
    "38": "BMW X5",
    "39": "BMW X6",
    "40": "BMW X7",
    "41": "BMW Z4",
    "42": "BMW i3",
    "43": "BMW i8",
    "44": "Bentley Bentayga",
    "45": "Bentley Continental GT",
    "46": "Bentley Flying Spur",
    "47": "Bentley Mulsanne",
    "48": "Buick Cascada",
    "49": "Buick Enclave",
    "50": "Buick Encore",
    "51": "Buick Envision",
    "52": "Buick Lacrosse",
    "53": "Buick Regal",
    "54": "Cadillac ATS",
    "55": "Cadillac CT4",
    "56": "Cadillac CT5",
    "57": "Cadillac CT6",
    "58": "Cadillac CTS",
    "59": "Cadillac Escalade",
    "60": "Cadillac XT4",
    "61": "Cadillac XT5",
    "62": "Cadillac XT6",
    "63": "Cadillac XTS",
    "64": "Chevrolet Blazer",
    "65": "Chevrolet Bolt EV",
    "66": "Chevrolet Camaro",
    "67": "Chevrolet Colorado",
    "68": "Chevrolet Corvette",
    "69": "Chevrolet Cruze",
    "70": "Chevrolet Equinox",
    "71": "Chevrolet Impala",
    "72": "Chevrolet Malibu",
    "73": "Chevrolet Silverado 1500",
    "74": "Chevrolet Silverado 2500HD",
    "75": "Chevrolet Sonic",
    "76": "Chevrolet Spark",
    "77": "Chevrolet Suburban",
    "78": "Chevrolet Tahoe",
    "79": "Chevrolet TrailBlazer",
    "80": "Chevrolet Traverse",
    "81": "Chevrolet Trax",
    "82": "Chevrolet Volt",
    "83": "Chrysler 300",
    "84": "Chrysler Pacifica",
    "85": "Dodge Challenger",
    "86": "Dodge Charger",
    "87": "Dodge Durango",
    "88": "Dodge Grand Caravan",
    "89": "Dodge Journey",
    "90": "FIAT 124 Spider",
    "91": "FIAT 500",
    "92": "FIAT 500L",
    "93": "FIAT 500X",
    "94": "FIAT 500e",
    "95": "Ferrari 488 GTB",
    "96": "Ferrari GTC4Lusso",
    "97": "Ferrari Portofino",
    "98": "Ford Ecosport",
    "99": "Ford Edge",
    "100": "Ford Escape",
    "101": "Ford Expedition",
    "102": "Ford Explorer",
    "103": "Ford F-150",
    "104": "Ford Fiesta",
    "105": "Ford Flex",
    "106": "Ford Fusion",
    "107": "Ford Mustang",
    "108": "Ford Ranger",
    "109": "Ford Super Duty F-250",
    "110": "Ford Taurus",
    "111": "Ford Transit Connect Wagon",
    "112": "GMC Acadia",
    "113": "GMC Canyon",
    "114": "GMC Sierra 1500",
    "115": "GMC Sierra 2500HD",
    "116": "GMC Terrain",
    "117": "GMC Yukon",
    "118": "Genesis G70",
    "119": "Genesis G80",
    "120": "Genesis G90",
    "121": "Honda Accord",
    "122": "Honda CR-V",
    "123": "Honda Civic",
    "124": "Honda Clarity",
    "125": "Honda Fit",
    "126": "Honda HR-V",
    "127": "Honda Insight",
    "128": "Honda Odyssey",
    "129": "Honda Passport",
    "130": "Honda Pilot",
    "131": "Honda Ridgeline",
    "132": "Hyundai Accent",
    "133": "Hyundai Elantra",
    "134": "Hyundai Ioniq",
    "135": "Hyundai Kona",
    "136": "Hyundai Kona Electric",
    "137": "Hyundai NEXO",
    "138": "Hyundai Palisade",
    "139": "Hyundai Santa Fe",
    "140": "Hyundai Sonata",
    "141": "Hyundai Tucson",
    "142": "Hyundai Veloster",
    "143": "Hyundai Venue",
    "144": "INFINITI Q50",
    "145": "INFINITI Q60",
    "146": "INFINITI Q70",
    "147": "INFINITI QX30",
    "148": "INFINITI QX50",
    "149": "INFINITI QX60",
    "150": "INFINITI QX80",
    "151": "Jaguar E-Pace",
    "152": "Jaguar F-Pace",
    "153": "Jaguar F-Type",
    "154": "Jaguar I-Pace",
    "155": "Jaguar XE",
    "156": "Jaguar XF",
    "157": "Jaguar XJ",
    "158": "Jeep Cherokee",
    "159": "Jeep Compass",
    "160": "Jeep Gladiator",
    "161": "Jeep Grand Cherokee",
    "162": "Jeep Renegade",
    "163": "Jeep Wrangler",
    "164": "Kia Cadenza",
    "165": "Kia Forte",
    "166": "Kia K900",
    "167": "Kia Niro",
    "168": "Kia Optima",
    "169": "Kia Rio",
    "170": "Kia Sedona",
    "171": "Kia Sorento",
    "172": "Kia Soul",
    "173": "Kia Soul EV",
    "174": "Kia Sportage",
    "175": "Kia Stinger",
    "176": "Kia Telluride",
    "177": "Lamborghini Aventador",
    "178": "Lamborghini Huracan",
    "179": "Lamborghini Urus",
    "180": "Land Rover Defender",
    "181": "Land Rover Discovery",
    "182": "Land Rover Discovery Sport",
    "183": "Land Rover Range Rover",
    "184": "Land Rover Range Rover Evoque",
    "185": "Land Rover Range Rover Sport",
    "186": "Land Rover Range Rover Velar",
    "187": "Lexus ES",
    "188": "Lexus GS",
    "189": "Lexus GX",
    "190": "Lexus IS",
    "191": "Lexus LC",
    "192": "Lexus LS",
    "193": "Lexus LX",
    "194": "Lexus NX",
    "195": "Lexus RC",
    "196": "Lexus RX",
    "197": "Lexus UX",
    "198": "Lincoln Aviator",
    "199": "Lincoln Continental",
    "200": "Lincoln Corsair",
    "201": "Lincoln MKC",
    "202": "Lincoln MKT",
    "203": "Lincoln MKZ",
    "204": "Lincoln Nautilus",
    "205": "Lincoln Navigator",
    "206": "MINI Clubman",
    "207": "MINI Cooper",
    "208": "MINI Cooper Countryman",
    "209": "Maserati Ghibli",
    "210": "Maserati GranTurismo",
    "211": "Maserati Levante",
    "212": "Maserati Quattroporte",
    "213": "Mazda CX-3",
    "214": "Mazda CX-30",
    "215": "Mazda CX-5",
    "216": "Mazda CX-9",
    "217": "Mazda MAZDA3",
    "218": "Mazda MAZDA6",
    "219": "Mazda MX-5 Miata",
    "220": "Mazda Mazda3 Hatchback",
    "221": "McLaren 570GT",
    "222": "McLaren 570S",
    "223": "McLaren 720S",
    "224": "Mercedes-Benz A Class",
    "225": "Mercedes-Benz AMG GT",
    "226": "Mercedes-Benz C Class",
    "227": "Mercedes-Benz CLA Class",
    "228": "Mercedes-Benz CLS Class",
    "229": "Mercedes-Benz E Class",
    "230": "Mercedes-Benz EQC",
    "231": "Mercedes-Benz G Class",
    "232": "Mercedes-Benz GLA Class",
    "233": "Mercedes-Benz GLB Class",
    "234": "Mercedes-Benz GLC Class",
    "235": "Mercedes-Benz GLE Class",
    "236": "Mercedes-Benz GLS Class",
    "237": "Mercedes-Benz Metris",
    "238": "Mercedes-Benz S Class",
    "239": "Mercedes-Benz SL Class",
    "240": "Mercedes-Benz SLC Class",
    "241": "Mitsubishi Eclipse Cross",
    "242": "Mitsubishi Mirage",
    "243": "Mitsubishi Outlander",
    "244": "Mitsubishi Outlander Sport",
    "245": "Nissan 370Z",
    "246": "Nissan Altima",
    "247": "Nissan Armada",
    "248": "Nissan Frontier",
    "249": "Nissan GT-R",
    "250": "Nissan Kicks",
    "251": "Nissan Leaf",
    "252": "Nissan Maxima",
    "253": "Nissan Murano",
    "254": "Nissan NV200",
    "255": "Nissan Pathfinder",
    "256": "Nissan Rogue",
    "257": "Nissan Rogue Sport",
    "258": "Nissan Sentra",
    "259": "Nissan Titan",
    "260": "Nissan Versa",
    "261": "Porsche 718",
    "262": "Porsche 718 Spyder",
    "263": "Porsche 911",
    "264": "Porsche Cayenne",
    "265": "Porsche Macan",
    "266": "Porsche Panamera",
    "267": "Porsche Taycan",
    "268": "Ram 1500",
    "269": "Ram 2500",
    "270": "Rolls-Royce Cullinan",
    "271": "Rolls-Royce Dawn",
    "272": "Rolls-Royce Ghost",
    "273": "Rolls-Royce Phantom",
    "274": "Rolls-Royce Wraith",
    "275": "Subaru Ascent",
    "276": "Subaru BRZ",
    "277": "Subaru Crosstrek",
    "278": "Subaru Forester",
    "279": "Subaru Impreza",
    "280": "Subaru Legacy",
    "281": "Subaru Outback",
    "282": "Subaru STI S209",
    "283": "Subaru WRX",
    "284": "Tesla Model 3",
    "285": "Tesla Model S",
    "286": "Tesla Model X",
    "287": "Tesla Model Y",
    "288": "Toyota 4Runner",
    "289": "Toyota 86",
    "290": "Toyota Avalon",
    "291": "Toyota C-HR",
    "292": "Toyota Camry",
    "293": "Toyota Corolla",
    "294": "Toyota Highlander",
    "295": "Toyota Land Cruiser",
    "296": "Toyota Mirai",
    "297": "Toyota Prius",
    "298": "Toyota Prius C",
    "299": "Toyota RAV4",
    "300": "Toyota Sequoia",
    "301": "Toyota Sienna",
    "302": "Toyota Supra",
    "303": "Toyota Tacoma",
    "304": "Toyota Tundra",
    "305": "Toyota Yaris",
    "306": "Toyota Yaris Hatchback",
    "307": "Volkswagen Arteon",
    "308": "Volkswagen Atlas",
    "309": "Volkswagen Beetle",
    "310": "Volkswagen Golf",
    "311": "Volkswagen Jetta",
    "312": "Volkswagen Passat",
    "313": "Volkswagen Tiguan",
    "314": "Volkswagen e-Golf",
    "315": "Volvo S60",
    "316": "Volvo S90",
    "317": "Volvo V60",
    "318": "Volvo V90",
    "319": "Volvo XC40",
    "320": "Volvo XC60",
    "321": "Volvo XC90",
    "322": "smart fortwo"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Acura ILX": 0,
    "Acura MDX": 1,
    "Acura NSX": 2,
    "Acura RDX": 3,
    "Acura RLX": 4,
    "Acura TLX": 5,
    "Alfa Romeo 4C": 6,
    "Alfa Romeo 4C Spider": 7,
    "Alfa Romeo Giulia": 8,
    "Alfa Romeo Stelvio": 9,
    "Aston Martin DB11": 10,
    "Aston Martin DBS": 11,
    "Aston Martin Vanquish": 12,
    "Aston Martin Vantage": 13,
    "Audi A3": 14,
    "Audi A4": 15,
    "Audi A5": 16,
    "Audi A6": 17,
    "Audi A7": 18,
    "Audi A8": 19,
    "Audi Q3": 20,
    "Audi Q5": 21,
    "Audi Q7": 22,
    "Audi Q8": 23,
    "Audi R8": 24,
    "Audi TT": 25,
    "Audi e-tron": 26,
    "BMW 2-Series": 27,
    "BMW 3-Series": 28,
    "BMW 4-Series": 29,
    "BMW 5-Series": 30,
    "BMW 6-Series": 31,
    "BMW 7-Series": 32,
    "BMW 8-Series": 33,
    "BMW X1": 34,
    "BMW X2": 35,
    "BMW X3": 36,
    "BMW X4": 37,
    "BMW X5": 38,
    "BMW X6": 39,
    "BMW X7": 40,
    "BMW Z4": 41,
    "BMW i3": 42,
    "BMW i8": 43,
    "Bentley Bentayga": 44,
    "Bentley Continental GT": 45,
    "Bentley Flying Spur": 46,
    "Bentley Mulsanne": 47,
    "Buick Cascada": 48,
    "Buick Enclave": 49,
    "Buick Encore": 50,
    "Buick Envision": 51,
    "Buick Lacrosse": 52,
    "Buick Regal": 53,
    "Cadillac ATS": 54,
    "Cadillac CT4": 55,
    "Cadillac CT5": 56,
    "Cadillac CT6": 57,
    "Cadillac CTS": 58,
    "Cadillac Escalade": 59,
    "Cadillac XT4": 60,
    "Cadillac XT5": 61,
    "Cadillac XT6": 62,
    "Cadillac XTS": 63,
    "Chevrolet Blazer": 64,
    "Chevrolet Bolt EV": 65,
    "Chevrolet Camaro": 66,
    "Chevrolet Colorado": 67,
    "Chevrolet Corvette": 68,
    "Chevrolet Cruze": 69,
    "Chevrolet Equinox": 70,
    "Chevrolet Impala": 71,
    "Chevrolet Malibu": 72,
    "Chevrolet Silverado 1500": 73,
    "Chevrolet Silverado 2500HD": 74,
    "Chevrolet Sonic": 75,
    "Chevrolet Spark": 76,
    "Chevrolet Suburban": 77,
    "Chevrolet Tahoe": 78,
    "Chevrolet TrailBlazer": 79,
    "Chevrolet Traverse": 80,
    "Chevrolet Trax": 81,
    "Chevrolet Volt": 82,
    "Chrysler 300": 83,
    "Chrysler Pacifica": 84,
    "Dodge Challenger": 85,
    "Dodge Charger": 86,
    "Dodge Durango": 87,
    "Dodge Grand Caravan": 88,
    "Dodge Journey": 89,
    "FIAT 124 Spider": 90,
    "FIAT 500": 91,
    "FIAT 500L": 92,
    "FIAT 500X": 93,
    "FIAT 500e": 94,
    "Ferrari 488 GTB": 95,
    "Ferrari GTC4Lusso": 96,
    "Ferrari Portofino": 97,
    "Ford Ecosport": 98,
    "Ford Edge": 99,
    "Ford Escape": 100,
    "Ford Expedition": 101,
    "Ford Explorer": 102,
    "Ford F-150": 103,
    "Ford Fiesta": 104,
    "Ford Flex": 105,
    "Ford Fusion": 106,
    "Ford Mustang": 107,
    "Ford Ranger": 108,
    "Ford Super Duty F-250": 109,
    "Ford Taurus": 110,
    "Ford Transit Connect Wagon": 111,
    "GMC Acadia": 112,
    "GMC Canyon": 113,
    "GMC Sierra 1500": 114,
    "GMC Sierra 2500HD": 115,
    "GMC Terrain": 116,
    "GMC Yukon": 117,
    "Genesis G70": 118,
    "Genesis G80": 119,
    "Genesis G90": 120,
    "Honda Accord": 121,
    "Honda CR-V": 122,
    "Honda Civic": 123,
    "Honda Clarity": 124,
    "Honda Fit": 125,
    "Honda HR-V": 126,
    "Honda Insight": 127,
    "Honda Odyssey": 128,
    "Honda Passport": 129,
    "Honda Pilot": 130,
    "Honda Ridgeline": 131,
    "Hyundai Accent": 132,
    "Hyundai Elantra": 133,
    "Hyundai Ioniq": 134,
    "Hyundai Kona": 135,
    "Hyundai Kona Electric": 136,
    "Hyundai NEXO": 137,
    "Hyundai Palisade": 138,
    "Hyundai Santa Fe": 139,
    "Hyundai Sonata": 140,
    "Hyundai Tucson": 141,
    "Hyundai Veloster": 142,
    "Hyundai Venue": 143,
    "INFINITI Q50": 144,
    "INFINITI Q60": 145,
    "INFINITI Q70": 146,
    "INFINITI QX30": 147,
    "INFINITI QX50": 148,
    "INFINITI QX60": 149,
    "INFINITI QX80": 150,
    "Jaguar E-Pace": 151,
    "Jaguar F-Pace": 152,
    "Jaguar F-Type": 153,
    "Jaguar I-Pace": 154,
    "Jaguar XE": 155,
    "Jaguar XF": 156,
    "Jaguar XJ": 157,
    "Jeep Cherokee": 158,
    "Jeep Compass": 159,
    "Jeep Gladiator": 160,
    "Jeep Grand Cherokee": 161,
    "Jeep Renegade": 162,
    "Jeep Wrangler": 163,
    "Kia Cadenza": 164,
    "Kia Forte": 165,
    "Kia K900": 166,
    "Kia Niro": 167,
    "Kia Optima": 168,
    "Kia Rio": 169,
    "Kia Sedona": 170,
    "Kia Sorento": 171,
    "Kia Soul": 172,
    "Kia Soul EV": 173,
    "Kia Sportage": 174,
    "Kia Stinger": 175,
    "Kia Telluride": 176,
    "Lamborghini Aventador": 177,
    "Lamborghini Huracan": 178,
    "Lamborghini Urus": 179,
    "Land Rover Defender": 180,
    "Land Rover Discovery": 181,
    "Land Rover Discovery Sport": 182,
    "Land Rover Range Rover": 183,
    "Land Rover Range Rover Evoque": 184,
    "Land Rover Range Rover Sport": 185,
    "Land Rover Range Rover Velar": 186,
    "Lexus ES": 187,
    "Lexus GS": 188,
    "Lexus GX": 189,
    "Lexus IS": 190,
    "Lexus LC": 191,
    "Lexus LS": 192,
    "Lexus LX": 193,
    "Lexus NX": 194,
    "Lexus RC": 195,
    "Lexus RX": 196,
    "Lexus UX": 197,
    "Lincoln Aviator": 198,
    "Lincoln Continental": 199,
    "Lincoln Corsair": 200,
    "Lincoln MKC": 201,
    "Lincoln MKT": 202,
    "Lincoln MKZ": 203,
    "Lincoln Nautilus": 204,
    "Lincoln Navigator": 205,
    "MINI Clubman": 206,
    "MINI Cooper": 207,
    "MINI Cooper Countryman": 208,
    "Maserati Ghibli": 209,
    "Maserati GranTurismo": 210,
    "Maserati Levante": 211,
    "Maserati Quattroporte": 212,
    "Mazda CX-3": 213,
    "Mazda CX-30": 214,
    "Mazda CX-5": 215,
    "Mazda CX-9": 216,
    "Mazda MAZDA3": 217,
    "Mazda MAZDA6": 218,
    "Mazda MX-5 Miata": 219,
    "Mazda Mazda3 Hatchback": 220,
    "McLaren 570GT": 221,
    "McLaren 570S": 222,
    "McLaren 720S": 223,
    "Mercedes-Benz A Class": 224,
    "Mercedes-Benz AMG GT": 225,
    "Mercedes-Benz C Class": 226,
    "Mercedes-Benz CLA Class": 227,
    "Mercedes-Benz CLS Class": 228,
    "Mercedes-Benz E Class": 229,
    "Mercedes-Benz EQC": 230,
    "Mercedes-Benz G Class": 231,
    "Mercedes-Benz GLA Class": 232,
    "Mercedes-Benz GLB Class": 233,
    "Mercedes-Benz GLC Class": 234,
    "Mercedes-Benz GLE Class": 235,
    "Mercedes-Benz GLS Class": 236,
    "Mercedes-Benz Metris": 237,
    "Mercedes-Benz S Class": 238,
    "Mercedes-Benz SL Class": 239,
    "Mercedes-Benz SLC Class": 240,
    "Mitsubishi Eclipse Cross": 241,
    "Mitsubishi Mirage": 242,
    "Mitsubishi Outlander": 243,
    "Mitsubishi Outlander Sport": 244,
    "Nissan 370Z": 245,
    "Nissan Altima": 246,
    "Nissan Armada": 247,
    "Nissan Frontier": 248,
    "Nissan GT-R": 249,
    "Nissan Kicks": 250,
    "Nissan Leaf": 251,
    "Nissan Maxima": 252,
    "Nissan Murano": 253,
    "Nissan NV200": 254,
    "Nissan Pathfinder": 255,
    "Nissan Rogue": 256,
    "Nissan Rogue Sport": 257,
    "Nissan Sentra": 258,
    "Nissan Titan": 259,
    "Nissan Versa": 260,
    "Porsche 718": 261,
    "Porsche 718 Spyder": 262,
    "Porsche 911": 263,
    "Porsche Cayenne": 264,
    "Porsche Macan": 265,
    "Porsche Panamera": 266,
    "Porsche Taycan": 267,
    "Ram 1500": 268,
    "Ram 2500": 269,
    "Rolls-Royce Cullinan": 270,
    "Rolls-Royce Dawn": 271,
    "Rolls-Royce Ghost": 272,
    "Rolls-Royce Phantom": 273,
    "Rolls-Royce Wraith": 274,
    "Subaru Ascent": 275,
    "Subaru BRZ": 276,
    "Subaru Crosstrek": 277,
    "Subaru Forester": 278,
    "Subaru Impreza": 279,
    "Subaru Legacy": 280,
    "Subaru Outback": 281,
    "Subaru STI S209": 282,
    "Subaru WRX": 283,
    "Tesla Model 3": 284,
    "Tesla Model S": 285,
    "Tesla Model X": 286,
    "Tesla Model Y": 287,
    "Toyota 4Runner": 288,
    "Toyota 86": 289,
    "Toyota Avalon": 290,
    "Toyota C-HR": 291,
    "Toyota Camry": 292,
    "Toyota Corolla": 293,
    "Toyota Highlander": 294,
    "Toyota Land Cruiser": 295,
    "Toyota Mirai": 296,
    "Toyota Prius": 297,
    "Toyota Prius C": 298,
    "Toyota RAV4": 299,
    "Toyota Sequoia": 300,
    "Toyota Sienna": 301,
    "Toyota Supra": 302,
    "Toyota Tacoma": 303,
    "Toyota Tundra": 304,
    "Toyota Yaris": 305,
    "Toyota Yaris Hatchback": 306,
    "Volkswagen Arteon": 307,
    "Volkswagen Atlas": 308,
    "Volkswagen Beetle": 309,
    "Volkswagen Golf": 310,
    "Volkswagen Jetta": 311,
    "Volkswagen Passat": 312,
    "Volkswagen Tiguan": 313,
    "Volkswagen e-Golf": 314,
    "Volvo S60": 315,
    "Volvo S90": 316,
    "Volvo V60": 317,
    "Volvo V90": 318,
    "Volvo XC40": 319,
    "Volvo XC60": 320,
    "Volvo XC90": 321,
    "smart fortwo": 322
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.44.2"
}
